---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
source: html/65b59d7d-bd7b-c71b-7159-dfc506a912ee.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection

The base class for StructuralSection specific classes, designed to provide common parameters and ability to differentiate between different structural section shapes.

## Syntax (C#)
```csharp
public class StructuralSection : IEnumerable,
	IDisposable
```